[
    {
        "title": "Home",
        "subsections": [
            {
                "title": "Welcome",
                "short": "Welcome",
                "paragraphs": [
                    "Greetings, my name is Gabriel and I'm a systems engineer passionate about data analysis and web application development.",
                    "I've worked with the computational tool https://www.r-project.org/ and the KDD methodology. I'm currently studying other tools such as https://www.python.org/ and svg charts, intending to amplify my possibilities.",
                    "I'm also studying languages associated with the web, since it seems to me that currently is the best way to present information."
                ],
                "slides": []
            }
        ],
        "banner": "img/home.svg"
    },
    {
        "title": "Data Analysis",
        "banner": "img/da.svg",
        "subsections": [
            {
                "title": "Exploratory analysis",
                "short": "Exploration",
                "paragraphs": [
                    "Identifying objects and attribute types allows us to treat them correctly. It may seem elementary, but it turns necessary when we face large amounts of attributes. We wouldn't apply a measure of central tendency to a date or graph a price bar plot.",
                    "Central tendency and dispersion, along with graphs that illustrate them, allow us to know the distribution of attribute values, correlation between several attributes and possible outliers."
                ],
                "slides": [
                    {
                        "id": 0,
                        "image": "img/da/boxplot.svg",
                        "text": "Age box plot"
                    },
                    {
                        "id": 1,
                        "image": "img/da/barplot.svg",
                        "text": "Survival bar plot"
                    }
                ]
            },
            {
                "title": "Preprocessing",
                "short": "Preprocessing",
                "paragraphs": [
                    "Real world databases contain errors, missing values ​​and spurious values. It's necessary to apply techniques to clean them. Data is often distributed in different objects or sources and it's necessary to integrate them in a consistent way to avoid the appearance of additional errors.",
                    "In general, data sources are not optimized for the analysis. It is necessary to reduce the computational cost through reduction techniques and to mold data through transformation techniques so they are prepared for the analysis."
                ],
                "slides": []
            },
            {
                "title": "Data mining",
                "short": "Mining",
                "paragraphs": [
                    "Various data mining techniques allow extracting information in the form of mathematical models. Classification techniques, which allow predicting an output attribute from other input attributes; Association techniques, which allow finding logical patterns of objects’ behavior; grouping techniques that allow finding similarities and dissimilarities between groups of objects; and outlier detection techniques ​​that allow to find objects with exceptional behaviors."
                ],
                "slides": []
            },
            {
                "title": "Pattern evaluation",
                "short": "Evaluation",
                "paragraphs": [
                    "Data mining yields patterns that are interesting from a technical point of view, that is, they have high interest measures; as support, trust or certainty, among others. However, not all the patterns found are usually interesting for the organization.",
                    "The evaluation of patterns is the stage of selecting the patterns that may represent some benefit for the factors interested in the study, according to their perspectives or expectations."
                ],
                "slides": []
            },
            {
                "title": "Knowledge presentation",
                "short": "Presentation",
                "paragraphs": [
                    "It becomes necessary to choose the appropriate representation techniques so that the interested factors can assimilate the results of the analysis, such as tables or graphs where models are exposed in a comprehensible way."
                ],
                "slides": []
            }
        ]
    },
    {
        "title": "Web Development",
        "banner": "img/wd.svg",
        "subsections": [
            {
                "title": "Front end",
                "short": "Front end",
                "paragraphs": [
                    "This very page is running entirely on the front end, meaning that is running entirely on your device. It was made using tools like AngularJS, UI Bootstrap and Bootstrap; along with plain HTML, CSS and JavaScript."
                ],
                "slides": []
            },
            {
                "title": "Back end",
                "short": "Back end",
                "paragraphs": [
                    "Some applications require updating and retrieving information from databases or using authenticated services, that’s when the back end comes in. Tools running on another machine will verify if you have permission to access or modify certain data."
                ],
                "slides": []
            }
        ]
    },
    {
        "title": "Contact",
        "banner": "img/home.svg",
        "subsections": [
            {
                "title": "Contact",
                "short": "Contact",
                "paragraphs": [],
                "slides": []
            }
        ]
    }
]